{
  "title": "À Propos de Moi",
  "intro": "Salut, je suis étudiant en informatique et développeur",
  "introText": "Je développe des logiciels et des applications dans le cadre de mes études et de mes projets personnels. J’aime travailler sur des systèmes concrets, surtout côté backend, et apprendre de nouveaux outils par la pratique.",
  "profileImage": "https://picsum.photos/400/400?random=1",
  "journey": "Mon Parcours",
  "journeyText": "Je suis actuellement étudiant en informatique et je travaille sur des projets en équipe ainsi que des projets personnels axés sur le développement applicatif et backend. J’ai de l’expérience en travail collaboratif et en méthodes de développement structurées.",
  "journeyImage": "https://picsum.photos/800/400?random=2",
  "whatIDo": "Ce Que Je Fais",
  "whatIDoText": "Je travaille sur des projets logiciels incluant des systèmes backend, des bases de données, des API et la logique applicative, autant seul qu’en équipe.",
  "skills": "Loisirs & Intérêts",
  "skillsText": "• Développement de jeux et systèmes de gameplay\n• Apprentissage de nouveaux outils et frameworks\n• Développement backend et orienté systèmes\n• Outils 3D et techniques comme Blender\n• Projets logiciels et jeux personnels",
  "skillsImages": [
    "https://picsum.photos/300/200?random=3",
    "https://picsum.photos/300/200?random=4",
    "https://picsum.photos/300/200?random=5"
  ],
  "philosophy": "À Propos de Moi",
  "philosophyText": "Je préfère travailler sur des projets concrets afin d’apprendre en construisant, en testant et en améliorant des systèmes réels. J’aime résoudre des problèmes, comprendre le fonctionnement interne des systèmes et améliorer continuellement mes compétences.",
  "outside": "En Dehors du Développement",
  "outsideText": "En dehors des études et du développement, je travaille sur des projets personnels, j’expérimente avec différents outils et j’apprends de nouvelles technologies à mon rythme.",
  "outsideImage": "https://picsum.photos/800/500?random=6"
}