{
  "title": "À Propos de Moi",
  "intro": "Salut, je suis Développeur",
  "introText": "Je construis des choses pour le web. Parfois elles cassent. La plupart du temps elles marchent. Je suis passionné par la création d'expériences numériques qui ne sont pas nulles—du code propre, des interfaces fluides et des solutions qui résolvent vraiment des problèmes.",
  "profileImage": "https://picsum.photos/400/400?random=1",
  "journey": "Le Parcours",
  "journeyText": "J'ai commencé à coder parce que je voulais faire un jeu. J'ai fini par construire des sites web, des applications et tout ce qui se trouve entre les deux. En chemin, j'ai appris un nombre ridicule de frameworks, cassé plus de choses que je ne peux compter, et appris que Stack Overflow est la plus grande réalisation de l'humanité.",
  "journeyImage": "https://picsum.photos/800/400?random=2",
  "whatIDo": "Ce Que Je Fais",
  "whatIDoText": "Je me spécialise dans le développement full-stack avec un focus sur les technologies web modernes. Frontend? Backend? DevOps? Ouais, je touche à tout. Un touche-à-tout, maître de Google les messages d'erreur.",
  "skills": "Compétences & Tech",
  "skillsText": "**Frontend:** React, Next.js, TypeScript, Tailwind CSS, GSAP, Three.js\n\n**Backend:** Node.js, Express, Python, PostgreSQL, MongoDB, Redis\n\n**Outils:** Git, Docker, AWS, Vercel, Figma, VS Code (évidemment)\n\n**En Apprentissage:** Rust, WebAssembly, peu importe le nouveau framework sorti cette semaine",
  "skillsImages": [
    "https://picsum.photos/300/200?random=3",
    "https://picsum.photos/300/200?random=4",
    "https://picsum.photos/300/200?random=5"
  ],
  "philosophy": "Ma Philosophie",
  "philosophyText": "Le code devrait être propre, les commentaires devraient être honnêtes, et le café devrait être fort. Je crois en la construction de choses qui comptent, l'itération rapide, et ne jamais avoir peur de tout jeter et recommencer quand quelque chose ne se sent pas bien.",
  "outside": "En Dehors du Code",
  "outsideText": "Quand je ne fixe pas un écran, vous me trouverez en train de fixer un écran différent (gaming), ou occasionnellement toucher de l'herbe. Je suis dans la production musicale, la photographie, les claviers mécaniques, et me convaincre que j'ai besoin d'un autre moniteur.",
  "outsideImage": "https://picsum.photos/800/500?random=6"
}